CREATE REFERENCE TABLE zz;
   create reference table    
-----------------------------
 table    -> zz
 shard id -> sh1,sh2,sh3,sh4
(2 rows)

CREATE REFERENCE TABLE zz2 ON sh3, sh4;
 create reference table 
------------------------
 table    -> zz2
 shard id -> sh3,sh4
(2 rows)

CREATE REFERENCE RELATION zz2;
ERROR:  reference relation zz2 already exists
SYNC REFERENCE TABLES ON sh1;
ERROR:  SYNC REFERENCE TABLES/RELATIONS currently unsupported
SYNC REFERENCE TABLE zz2 ON sh1;
ERROR:  can't lock relation "public.zz2": ERROR: relation "public.zz2" does not exist (SQLSTATE 42P01)
ALTER DISTRIBUTION 'REPLICATED' ALTER RELATION zz2 SCHEMA my_schema;
          alter relation          
----------------------------------
 distribution id -> REPLICATED
 relation name   -> my_schema.zz2
(2 rows)

ALTER DISTRIBUTION 'REPLICATED' ALTER RELATION zz2 DISTRIBUTION KEY id;
ERROR:  setting distribution key is forbidden for reference relations
DROP REFERENCE RELATION zz2;
 drop reference relation 
-------------------------
 relation -> zz2
(1 row)

--should fail
DROP REFERENCE RELATION zz2;
ERROR:  reference relation "zz2" not found
DROP DISTRIBUTION ALL CASCADE;
       drop distribution       
-------------------------------
 distribution id -> REPLICATED
(1 row)

DROP KEY RANGE ALL;
 drop key range 
----------------
(0 rows)

