\c spqr-console

		SPQR router admin console
	Here you can configure your routing rules
------------------------------------------------
	You can find documentation here 
https://github.com/pg-sharding/spqr/tree/master/docs

CREATE REPLICATED DISTRIBUTION;
       add distribution        
-------------------------------
 distribution id -> REPLICATED
(1 row)

ALTER REPLICATED DISTRIBUTION ATTACH RELATION test_ref_rel;
ERROR:  distribution "" not found.
-- test both ways of ref relation crete syntax
CREATE REFERENCE TABLE test_ref_rel_2;
           attach table            
-----------------------------------
 relation name   -> test_ref_rel_2
 distribution id -> REPLICATED
(2 rows)

\c regress
CREATE TABLE test_ref_rel(i int, j int);
ERROR:  client processing error: error processing query 'CREATE TABLE test_ref_rel(i int, j int);': distribution for relation "test_ref_rel" not found., tx status IDLE
CREATE TABLE test_ref_rel_2(i int, j int);
COPY test_ref_rel FROM STDIN;
ERROR:  relation "test_ref_rel" does not exist
1	2
2	3
3	4
4	5
\.
invalid command \.
COPY test_ref_rel_2 FROM STDIN;
ERROR:  client processing error: error processing query '1	2
2	3
3	4
4	5
COPY test_ref_rel_2 FROM STDIN;': syntax error on pos 0, tx status IDLE
1	2
2	3
3	4
4	5
\.
invalid command \.
TABLE test_ref_rel /* __spqr__execute_on: sh1 */;
ERROR:  client processing error: error processing query '1	2
2	3
3	4
4	5
TABLE test_ref_rel /* __spqr__execute_on: sh1 */;': syntax error on pos 0, tx status IDLE
TABLE test_ref_rel /* __spqr__execute_on: sh2 */;
ERROR:  relation "test_ref_rel" does not exist
LINE 1: TABLE test_ref_rel /* __spqr__execute_on: sh2 */;
              ^
TABLE test_ref_rel_2 /* __spqr__execute_on: sh1 */;
 i | j 
---+---
(0 rows)

TABLE test_ref_rel_2 /* __spqr__execute_on: sh2 */;
 i | j 
---+---
(0 rows)

DROP TABLE test_ref_rel;
ERROR:  table "test_ref_rel" does not exist
DROP TABLE test_ref_rel_2;
\c spqr-console

		SPQR router admin console
	Here you can configure your routing rules
------------------------------------------------
	You can find documentation here 
https://github.com/pg-sharding/spqr/tree/master/docs

DROP DISTRIBUTION ALL CASCADE;
       drop distribution       
-------------------------------
 distribution id -> REPLICATED
(1 row)

DROP KEY RANGE ALL;
 drop key range 
----------------
(0 rows)

