\c spqr-console

		SPQR router admin console
	Here you can configure your routing rules
------------------------------------------------
	You can find documentation here 
https://github.com/pg-sharding/spqr/tree/master/docs

-- test both ways of ref relation crete syntax
CREATE REFERENCE TABLE test_ref_rel;
          attach table           
---------------------------------
 relation name   -> test_ref_rel
 distribution id -> REPLICATED
(2 rows)

\c regress
CREATE TABLE test_ref_rel(i int, j int);
NOTICE: send query to shard(s) : sh1,sh2
COPY test_ref_rel FROM STDIN;
NOTICE: send query to shard(s) : sh1,sh2
set __spqr__default_route_behaviour to allow;
TABLE test_ref_rel /*__spqr__execute_on: sh1*/;
NOTICE: send query to shard(s) : sh1
 i | j 
---+---
 1 | 2
 2 | 3
 3 | 4
 4 | 5
(4 rows)

set __spqr__default_route_behaviour to block;
TABLE test_ref_rel /*__spqr__execute_on: sh2*/;
NOTICE: send query to shard(s) : sh2
 i | j 
---+---
 1 | 2
 2 | 3
 3 | 4
 4 | 5
(4 rows)

INSERT INTO test_ref_rel VALUES(1);
ERROR:  client processing error: error processing query 'INSERT INTO test_ref_rel VALUES(1);': Not implemented., tx status IDLE
INSERT INTO test_ref_rel SELECT 1;
ERROR:  client processing error: error processing query 'INSERT INTO test_ref_rel SELECT 1;': Not implemented., tx status IDLE
UPDATE test_ref_rel SET i = i + 1;
ERROR:  client processing error: error processing query 'UPDATE test_ref_rel SET i = i + 1;': Not implemented., tx status IDLE
DELETE FROM test_ref_rel WHERE i = 2;
ERROR:  client processing error: error processing query 'DELETE FROM test_ref_rel WHERE i = 2;': Not implemented., tx status IDLE
DROP TABLE test_ref_rel;
NOTICE: send query to shard(s) : sh1,sh2
\c spqr-console

		SPQR router admin console
	Here you can configure your routing rules
------------------------------------------------
	You can find documentation here 
https://github.com/pg-sharding/spqr/tree/master/docs

DROP DISTRIBUTION ALL CASCADE;
       drop distribution       
-------------------------------
 distribution id -> REPLICATED
(1 row)

DROP KEY RANGE ALL;
 drop key range 
----------------
(0 rows)

